// kulmuhametova_lab1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
    setlocale(LC_ALL, "Russian");
    Pipe myPipe;
    KS myCS;
    cout << "Создание трубы\n";
    myPipe.input();
    cout << "\nСоздание КС\n";
    myCS.input();
    int choice = -1;
    while (choice != 0) {
        cout << "\nМЕНЮ\n";
        cout << "1. Просмотр\n";
        cout << "2. Редактировать трубу\n";
        cout << "3. Редактировать КС\n";
        cout << "0. Выход\n";
        cout << "Выберите действие: ";
        cin >> choice;
        if (choice == 1) {
            myPipe.print();
            myCS.print();
        }
        else if (choice == 2) {
            if (myPipe.inRepair == true) {
                myPipe.inRepair = false;
            }
            else {
                myPipe.inRepair = true;
            }
            cout << "Статус ремонта изменён.\n";
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
